---
kind: other
id: Properties.T:Autodesk.Revit.DB.Events.ViewPrintingEventArgs
source: html/0da83726-fdba-d842-3d2b-fe702cefbec1.htm
---
# ViewPrintingEventArgs Properties

Indicates whether an event may be cancelled by an event delegate.